openfoam_templates/opposed_piston_rotary_valve_sliding_case/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;
mergeTolerance  1e-6;

geometry
{
    cylinder.stl { type triSurfaceMesh; name cylinder; }
    intakeValve.stl { type triSurfaceMesh; name intakeValve; }
    exhaustValveLeft.stl { type triSurfaceMesh; name exhaustValveLeft; }
    exhaustValveRight.stl { type triSurfaceMesh; name exhaustValveRight; }
    intakeValveInterface.stl { type triSurfaceMesh; name intakeValveInterface; }
    exhaustValveLeftInterface.stl { type triSurfaceMesh; name exhaustValveLeftInterface; }
    exhaustValveRightInterface.stl { type triSurfaceMesh; name exhaustValveRightInterface; }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 200000;
    minRefinementCells 0;
    nCellsBetweenLevels 2;
    features ();
    refinementSurfaces
    {
        cylinder { level (1 1); }
        intakeValve { level (1 1); }
        exhaustValveLeft { level (1 1); }
        exhaustValveRight { level (1 1); }
        intakeValveInterface
        {
            level           (1 1);
            faceZone        intakeValveZone;
            cellZone        intakeValveZone;
            cellZoneInside  insidePoint;
            insidePoint     {{intake_interface_point}};
        }
        exhaustValveLeftInterface
        {
            level           (1 1);
            faceZone        exhaustValveLeftZone;
            cellZone        exhaustValveLeftZone;
            cellZoneInside  insidePoint;
            insidePoint     {{exhaust_left_interface_point}};
        }
        exhaustValveRightInterface
        {
            level           (1 1);
            faceZone        exhaustValveRightZone;
            cellZone        exhaustValveRightZone;
            cellZoneInside  insidePoint;
            insidePoint     {{exhaust_right_interface_point}};
        }
    }
    refinementRegions
    {
    }
    resolveFeatureAngle 30;
    locationInMesh (0 0 0.09);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;
    layers {};
}

meshQualityControls
{
    maxNonOrtho 70;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}
