openfoam_templates/opposed_piston_rotary_valve_sliding_case/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

combustionModel      PaSR;
active               yes;

PaSRCoeffs
{
    Cmix            0.03;
}
