openfoam_templates/opposed_piston_rotary_valve_sliding_case/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

chemistryReader     foamChemistryReader;

foamChemistryFile   "<constant>/reactions";

foamChemistryThermoFile "<constant>/thermo.compressibleGas";

inertSpecie     N2;

liquids
{
    IC8H18;
}

solids
{}
