openfoam_templates/opposed_piston_rotary_valve_sliding_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 {{handoff_velocity_m_s}});
boundaryField
{
    inlet { type pressureInletOutletVelocity; value uniform (0 0 {{handoff_velocity_m_s}}); }
    outlet { type zeroGradient; }
    walls { type noSlip; }
    cylinder { type noSlip; }
    intakeValve { type movingWallVelocity; value uniform (0 0 0); }
    exhaustValveLeft { type movingWallVelocity; value uniform (0 0 0); }
    exhaustValveRight { type movingWallVelocity; value uniform (0 0 0); }
    "AMI_.*" { type cyclicAMI; }
}
