openfoam_templates/opposed_piston_rotary_valve_sliding_case/0/residualTracer
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      residualTracer;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet { type fixedValue; value uniform 0; }
    outlet { type zeroGradient; }
    walls { type zeroGradient; }
    cylinder { type zeroGradient; }
    intakeValve { type zeroGradient; }
    exhaustValveLeft { type zeroGradient; }
    exhaustValveRight { type zeroGradient; }
    "AMI_.*" { type cyclicAMI; }
}
