openfoam_templates/opposed_piston_rotary_valve_sliding_case/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions ();
